.include "tn2313def.inc"

.include "..\macro\tinymacro.inc"		; Подключаем макросы
 
 
; RAM ==========================================================
		.DSEG			; Сегмент ОЗУ

; END RAM ======================================================


; FLASH ========================================================
		.CSEG			; Кодовый сегмент

; Interrupts ===================================================


; End Interrupts ===============================================


; Initialisation / Инициалищация ===============================
.include "../lib/coreinit.inc"   ; Подключаем файл с кодом инициализации


; Internal Hardware Init  ======================================
	; установка пинов порта D на выход
	SETB	DDRD,2,R16	; DDRD.2 = 1
	SETB	DDRD,4,R16	; DDRD.4 = 1
	SETB	DDRD,5,R16	; DDRD.5 = 1

	; инициализация пина, на котором кнопка, на вход
	SETB	PORTD,6,R16	; устанавливаем 6 бит регистра PORTD в 1 - pullUp режим
	CLRB	DDRD,6,R16	; устанавливаем пин в 0 - pullUp

; End Internal Hardware Init ===================================

 
; External Hardware Init  ======================================
 
; End Internal Hardware Init ===================================

 
; Run ==========================================================


; End Run ======================================================


; Main =========================================================
Main:
		SBIS	PIND,6				; Если кнопка нажата - переход
		RJMP	BT_Push


		SETB	PORTD,4			; Зажгем LED1
		CLRB	PORTD,2			; Погасим LED0
 
Next:	INVB	PORTD,5,R16,R17		; Инвертировали LED2
 
		RCALL 	Delay
 
		RJMP	Main
 
 
BT_Push:
		SETB	PORTD,2			; Зажгем LED0
		CLRB	PORTD,4			; Погасим LED1
 
		RJMP	Next


; End Main =====================================================



; Procedure ====================================================
.equ 	LowByte  = 100
.equ	MedByte  = 100
.equ	HighByte = 0
 
Delay:	LDI	R16,LowByte	; Грузим три байта
		LDI	R17,MedByte	; Нашей выдержки
		LDI	R18,HighByte

 
loop:	SUBI	R16,1		; Вычитаем 1
		SBCI	R17,0		; Вычитаем только С
		SBCI	R18,0		; Вычитаем только С
 
		BRCC	Loop		; Если нет переноса - переход 
		RET
; End Procedure ================================================


; EEPROM =======================================================
		.ESEG			; Сегмент EEPROM
